<?php

namespace Domain\FantasyRPG\Person;

class Personality
{
    // TODO:
    // архетипы: "Воин", "Мудрец", "Искатель приключений", "Амбициозный", "Интроверт" - шаблоны базовых характеристик
    // Специализации - бонусы к характеристикам + уникальные возможности  "Мастер меча", "Мастер магии огня", "Снайпер", "Подслушивание"
    // Моральные характеристики - "Честность", "Жестокость", "Милосердие", "Мстительность"
    // эмоциональное состояние - "Счастливый", "Гневный", "Опасающийся", "Подавленный"
    // поведение - "Прямолинейный", "Загадочный", "Саркастический", "Щепетильный"
}
